9/data/attachments/73b5f8c4b0d847ea.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d366836b-e2c0-4eb9-9fd1-af3937f5afc0</nif:username>
            <nif:friendToBeAdded>Samuel_perhaps_Friend_85066_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>